In [180]:
import pandas as pd

data = {
    "producto":["manzanas", "peras", "banana","narajas"],
    "precio": [2.5, 3.0, 1.8, 2.2],
    "cantida_vendida": [100,150,200,80],
    "mes":["enero","enero","febrero","febrero"]
}

df_data =pd.DataFrame(data)
print(df_data)

   producto  precio  cantida_vendida      mes
0  manzanas     2.5              100    enero
1     peras     3.0              150    enero
2    banana     1.8              200  febrero
3   narajas     2.2               80  febrero

In [181]:
df_data.agg({"precio": ["mean", "max"],"cantida_vendida": "sum"})

      precio  cantida_vendida
mean   2.375              NaN
max    3.000              NaN
sum      NaN            530.0

In [182]:
df_data=df_data[df_data["mes"]=="enero"]
print(df_data)

   producto  precio  cantida_vendida    mes
0  manzanas     2.5              100  enero
1     peras     3.0              150  enero

In [183]:
df_data2 = df_data[["producto","cantida_vendida"]]
print(df_data2)

   producto  cantida_vendida
0  manzanas              100
1     peras              150

In [184]:
df_data["precio"] = df_data["precio"] * 1.1
print(df_data)

   producto  precio  cantida_vendida    mes
0  manzanas    2.75              100  enero
1     peras    3.30              150  enero

In [185]:
data3 = {
    "producto":["manzanas", None, "banana","narajas","manzanas"],
    "precio": [2.5, None, 1.8, 2.2,2.5],
    "cantida_vendida": [100,150,200,80,100],
    "mes":["enero","enero","febrero",None,"enero"]
}

df_data3 =pd.DataFrame(data3)
print(df_data3)

   producto  precio  cantida_vendida      mes
0  manzanas     2.5              100    enero
1      None     NaN              150    enero
2    banana     1.8              200  febrero
3   narajas     2.2               80     None
4  manzanas     2.5              100    enero

In [186]:
print(df_data3.isnull())
print(df_data3.isnull().sum())

   producto  precio  cantida_vendida    mes
0     False   False            False  False
1      True    True            False  False
2     False   False            False  False
3     False   False            False   True
4     False   False            False  False
producto           1
precio             1
cantida_vendida    0
mes                1
dtype: int64

In [187]:
print(df_data3.notnull())

   producto  precio  cantida_vendida    mes
0      True    True             True   True
1     False   False             True   True
2      True    True             True   True
3      True    True             True  False
4      True    True             True   True

In [188]:
print(df_data3.duplicated())
print(df_data3.duplicated().sum())

0    False
1    False
2    False
3    False
4     True
dtype: bool
1

In [189]:
print(df_data3.drop_duplicates())

   producto  precio  cantida_vendida      mes
0  manzanas     2.5              100    enero
1      None     NaN              150    enero
2    banana     1.8              200  febrero
3   narajas     2.2               80     None

In [190]:
nombres = {
    "nombres":["jonier", "julian", "francisco","nataly"],
    "cedula": [1018, 5042,2015,5042]  
}

df_nombres =pd.DataFrame(nombres)
print(df_nombres)

     nombres  cedula
0     jonier    1018
1     julian    5042
2  francisco    2015
3     nataly    5042

In [191]:
df_nombres = df_nombres.drop_duplicates() #no eliminaria nada
print(df_nombres)
print("-------------------------------------------------")
df_nombres = df_nombres.drop_duplicates(subset="cedula") # con subset y la columna eliminaria el duplicado
print(df_nombres)

     nombres  cedula
0     jonier    1018
1     julian    5042
2  francisco    2015
3     nataly    5042
-------------------------------------------------
     nombres  cedula
0     jonier    1018
1     julian    5042
2  francisco    2015

In [192]:
nombre_1 ={
    "nombre":["jonier", "julian", "francisco","nataly"],
    "apellido":["porras","rodriguez","parra","ortiz"],
    "id":[4020,5009,1010,1085]
}

nombre_2 ={
    "nombre":["pedro", "fredy", "miguel","sara"],
    "apellido":["ariza","fernandez","alfonso","perez"]
}

numeros_1 ={
    "cedula":[1018,4020,5009,1058,5210],
    "edad":[32,45,26,58,65],
    "id":[4020,5009,1010,1085,2010]
}

df_nombre_1 = pd.DataFrame(nombre_1)
df_nombre_2 = pd.DataFrame(nombre_2)
df_numeros = pd.DataFrame(numeros_1)

print(pd.concat([df_nombre_1,df_nombre_2,df_numeros]))
print(pd.concat([df_nombre_1,df_nombre_2]))

      nombre   apellido      id  cedula  edad
0     jonier     porras  4020.0     NaN   NaN
1     julian  rodriguez  5009.0     NaN   NaN
2  francisco      parra  1010.0     NaN   NaN
3     nataly      ortiz  1085.0     NaN   NaN
0      pedro      ariza     NaN     NaN   NaN
1      fredy  fernandez     NaN     NaN   NaN
2     miguel    alfonso     NaN     NaN   NaN
3       sara      perez     NaN     NaN   NaN
0        NaN        NaN  4020.0  1018.0  32.0
1        NaN        NaN  5009.0  4020.0  45.0
2        NaN        NaN  1010.0  5009.0  26.0
3        NaN        NaN  1085.0  1058.0  58.0
4        NaN        NaN  2010.0  5210.0  65.0
      nombre   apellido      id
0     jonier     porras  4020.0
1     julian  rodriguez  5009.0
2  francisco      parra  1010.0
3     nataly      ortiz  1085.0
0      pedro      ariza     NaN
1      fredy  fernandez     NaN
2     miguel    alfonso     NaN
3       sara      perez     NaN

In [197]:
#df_final_1 = df_nombre_1.join(df_numeros, how="left")
#print(df_final_1)

print("------------------------------------------")
#df_final_2 = df_nombre_1.join(df_numeros, how="right")
#print(df_final_2)

------------------------------------------

In [200]:
df_final_3 = df_nombre_1.merge(df_numeros, on="id")
print(df_final_3)

      nombre   apellido    id  cedula  edad
0     jonier     porras  4020    1018    32
1     julian  rodriguez  5009    4020    45
2  francisco      parra  1010    5009    26
3     nataly      ortiz  1085    1058    58

In [201]:
df_nombre_1["apellido"].replace({"ortiz": "aguilar"},inplace=True)
df_nombre_1["nombre"].replace({"francisco": "jenny"},inplace=True)

print(df_nombre_1)

   nombre   apellido    id
0  jonier     porras  4020
1  julian  rodriguez  5009
2   jenny      parra  1010
3  nataly    aguilar  1085

C:\Users\ANDAP\AppData\Local\Temp\ipykernel_7548\3484168522.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_nombre_1["nombre"].replace({"francisco": "jenny"},inplace=True)